{
  "architectures": [
    "ErnieForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "fuse": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "系统全面",
    "1": "耐心细致",
    "2": "条理清晰",
    "3": "风趣幽默",
    "4": "设计巧妙",
    "5": "视频质量",
    "6": "课件质量"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "条理清晰": 2,
    "系统全面": 0,
    "耐心细致": 1,
    "视频质量": 5,
    "设计巧妙": 4,
    "课件质量": 6,
    "风趣幽默": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "ernie",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "paddlenlp_version": null,
  "pool_act": "tanh",
  "task_id": 0,
  "task_type_vocab_size": 16,
  "type_vocab_size": 4,
  "use_task_id": false,
  "vocab_size": 40000
}
